
#Программа консольный менеджер


while True:
    print('1. Создать папку')
    print('2. Удалить (файл/папку)')
    print('3. Копировать (файл/папку)')
    print('4. Просмотр содержимого рабочей директории')
    print('5. Вывод всех объектов в рабочей папке')
    print('6. Вывод только файлов которые находятся в рабочей папке')
    print('7. Вывести информацию об операционной системе')
    print('8. Cоздатель программы')
    print('9. Играть в викторину')
    print('10. Мой банковский счет')
    print('11. Cмена рабочей директории')
    print('12. выход')


